'''
< 오르막 수 >
- 자리가 오른차순을 이루는 수
입력)
- N ~ [1 \ 1000] 자리수?
출력)
-
1 ----
0 1 2 3 4 5 6 7 8 9
2 ----
00[1] 01 11[2]
dp[i][j]
dp
row[j] : 그수가몇으로 끝나는가???
(0) 0 1 1[00]             1[000] 
(1) 0 1 2[01, 11]         2[001, ] 
(2) 0 1 3[02, 12, 22]
(3) 0 1 4[03, 13, 23, 33]
(4) 0 1 
(5) 0 1
(0) 0 1
(0) 0 1
(0) 0 1
(0) 0 1
sum(dp[N])
sum(dp)
>>>>>>>>>> row col 반대로
'''
import sys
input = sys.stdin.readline

dp = [[1] * 10 for _ in range(1001)]
for i in range(2, 1001): # 
    for j in range(1, 10):
        dp[i][j] = dp[i - 1][j] + dp[i][j - 1]
        dp[i][j] %= 10007

print(sum(dp[int(input())]) % 10007)